In [1]:
import pandas as pd 

data ={ 
    'Name':['Alice','Bob','Charlie','David','Eva'],
    'Age': [23,35,45,36,28],
    'City':['New York','Los Angeles','Chicago','Houston','Phoenix']
}
df=pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston
4      Eva   28      Phoenix

In [2]:
df.iloc[2]

Name    Charlie
Age          45
City    Chicago
Name: 2, dtype: object

In [3]:
df.iloc[:,1]

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

In [4]:
df.iloc[0:3]

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago

In [5]:
df.iloc[:,[0,2]]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston
4      Eva      Phoenix

In [6]:
df.loc[2]

Name    Charlie
Age          45
City    Chicago
Name: 2, dtype: object

In [7]:
df.loc[:,'Age']

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

In [8]:
 df.loc[[1, 4], 'City']

1    Los Angeles
4        Phoenix
Name: City, dtype: object

# In Class exercise 2

In [9]:
import pandas as pd 

data ={ 
    'Name':['Alice','Bob','Charlie','David','Eva'],
    'Age': [23,35,45,36,28],
    'City':['New York','Los Angeles','Chicago','Houston','Phoenix']
}
df=pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston
4      Eva   28      Phoenix

In [10]:
df.loc[df['Age'] > 30]

      Name  Age         City
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston

In [11]:
df.loc[df['City'].isin(['Chicago', 'Houston'])]

      Name  Age     City
2  Charlie   45  Chicago
3    David   36  Houston

In [12]:
df.set_index('Name', inplace=True)
df.loc['David']

Age          36
City    Houston
Name: David, dtype: object

In [13]:
df.loc[['Bob', 'Eva'], ['Age', 'City']]

      Age         City
Name
Bob    35  Los Angeles
Eva    28      Phoenix

# In Class exercise 3

In [14]:
import pandas as pd 

data = {
'Product': ['Apple', 'Banana', 'Carrot', 'Doughnut', 'Egg'],
'Price': [0.5, 0.3, 0.4, 1.0, 0.2],
'In Stock': [True, True, False, True, False]
}
df = pd.DataFrame(data)
print(df)

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
2    Carrot    0.4     False
3  Doughnut    1.0      True
4       Egg    0.2     False

In [15]:
df.loc[df['In Stock']]

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
3  Doughnut    1.0      True

In [17]:
df.loc[df['Product'] == 'Doughnut', 'Price'] = 1.2

In [18]:
print(df)

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
2    Carrot    0.4     False
3  Doughnut    1.2      True
4       Egg    0.2     False

In [19]:
df.loc[df['Price'] < 0.5]

  Product  Price  In Stock
1  Banana    0.3      True
2  Carrot    0.4     False
4     Egg    0.2     False

In [20]:
df.loc[~df['In Stock'], ['Product', 'Price']]

  Product  Price
2  Carrot    0.4
4     Egg    0.2